candy_store/app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
    def index
        @candies = Candy.all

SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @candy = Candy.find(params[:id])

INSERT INTO "candies" ("name", "calories", "wrapper_color", "has_nuts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Skittles"], ["calories", 120], ["wrapper_color", "Red"], ["has_nuts", 0], ["created_at", "2020-10-29 19:29:18.645134"], ["updated_at", "2020-10-29 19:29:18.645134"]]
---
    def create
      @candy = Candy.create(name: params[:name],
                 calories: params[:calories],
                 wrapper_color: params[:wrapper_color],
                 has_nuts: params[:has_nuts])

SELECT "candies".* FROM "candies" ORDER BY "candies"."name" ASC
SELECT "candies".* FROM "candies" ORDER BY "candies"."calories" ASC
---
    def sort_by
        # render 'index'
       @candies = Candy.order(:name)
       @candies = Candy.order(:calories)